klactrafob/esp32-c3_matter/src/core/cfg_json.c
#include "cfg_json.h"

#include <stdarg.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_log.h"
#include "esp_mac.h"
#include "nvs.h"
#include "soc/soc_caps.h"

static const char *TAG = "cfg_json";
static const char *NVS_NS = "cfg";
static const char *NVS_KEY = "json";

#define CFG_SCHEMA_VERSION 2
#define CFG_MAX_OUTPUTS 8
#define CFG_MAX_INPUTS_AND_BUTTONS 8
#define CFG_MAX_SENSORS 4
#define SERVO_3WIRE_HOLD_MS_DEFAULT 1200

static const int s_conservative_board_gpios[] = {0, 1, 3, 4, 5, 6, 7, 10};
static const int s_luatos_board_gpios[] = {0, 1, 3, 4, 5, 6, 7, 10, 12, 13};

static const char *BOARD_PROFILE = "esp32-c3-supermini";
static const char *MQTT_DISCOVERY_PREFIX_DEFAULT = "homeassistant";
static const char *DEVICE_NAME_DEFAULT = "ESP32 C3 MQTT Device";
static const char *AP_SSID_DEFAULT = "ESP32-SETUP";

typedef struct {
    const char *profile;
    const int *gpios;
    size_t gpio_count;
} board_gpio_policy_t;

static const board_gpio_policy_t s_board_gpio_policies[] = {
    {
        .profile = "esp32-c3-supermini",
        .gpios = s_conservative_board_gpios,
        .gpio_count = sizeof(s_conservative_board_gpios) / sizeof(s_conservative_board_gpios[0]),
    },
    {
        .profile = "esp32-c3-luatos",
        .gpios = s_luatos_board_gpios,
        .gpio_count = sizeof(s_luatos_board_gpios) / sizeof(s_luatos_board_gpios[0]),
    },
};

static cJSON *s_cfg = NULL;
static char s_last_error[192] = "";

typedef struct {
    bool used;
    char group[16];
    char owner[40];
} gpio_reservation_t;

typedef struct {
    bool used;
    int freq_hz;
} ledc_timer_reservation_t;

typedef struct {
    gpio_reservation_t pins[32];
    char ids[32][24];
    int id_count;
    char board_profile[32];
    bool i2c_bus_seen;
    int i2c_sda;
    int i2c_scl;
    int i2c_freq;
    bool onewire_seen;
    int onewire_gpio;
    ledc_timer_reservation_t ledc_timers[SOC_LEDC_TIMER_NUM];
    int ledc_timer_count;
    int ledc_channel_count;
    int rmt_tx_blocks_used;
    int rmt_rx_blocks_used;
} cfg_validation_t;

static void set_error(const char *fmt, ...)
{
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(s_last_error, sizeof(s_last_error), fmt, ap);
    va_end(ap);
}

const char *cfg_json_last_error(void)
{
    return s_last_error[0] ? s_last_error : "unknown config error";
}

static void clear_error(void)
{
    s_last_error[0] = 0;
}

static const cJSON *jobj(const cJSON *obj, const char *key)
{
    if (!cJSON_IsObject((cJSON *)obj)) {
        return NULL;
    }
    return cJSON_GetObjectItemCaseSensitive((cJSON *)obj, key);
}

static const char *jstr(const cJSON *obj, const char *key, const char *def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsString(it) && it->valuestring) {
        return it->valuestring;
    }
    return def;
}

static const char *jstr_alias(const cJSON *obj, const char *key, const char *alias, const char *def)
{
    const char *value = jstr(obj, key, NULL);
    if (value && value[0] != 0) {
        return value;
    }
    value = jstr(obj, alias, NULL);
    if (value && value[0] != 0) {
        return value;
    }
    return def;
}

static bool jbool(const cJSON *obj, const char *key, bool def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsBool(it)) {
        return cJSON_IsTrue(it);
    }
    return def;
}

static int jint(const cJSON *obj, const char *key, int def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsNumber(it)) {
        return it->valueint;
    }
    return def;
}

static int jint_alias(const cJSON *obj, const char *key, const char *alias, int def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsNumber(it)) {
        return it->valueint;
    }
    it = jobj(obj, alias);
    if (cJSON_IsNumber(it)) {
        return it->valueint;
    }
    return def;
}

static const cJSON *get_connectivity_obj(const cJSON *src)
{
    const cJSON *conn = jobj(src, "connectivity");
    if (cJSON_IsObject((cJSON *)conn)) {
        return conn;
    }
    return jobj(src, "net");
}

static const cJSON *get_mqtt_obj(const cJSON *src)
{
    const cJSON *conn = jobj(src, "connectivity");
    const cJSON *mqtt = jobj(conn, "mqtt");
    if (cJSON_IsObject((cJSON *)mqtt)) {
        return mqtt;
    }
    mqtt = jobj(src, "mqtt");
    if (cJSON_IsObject((cJSON *)mqtt)) {
        return mqtt;
    }
    return NULL;
}

static void build_board_node_id(char *dst, size_t dst_len)
{
    if (!dst || dst_len == 0) {
        return;
    }

    uint8_t mac[6] = {0};
    if (esp_efuse_mac_get_default(mac) == ESP_OK) {
        snprintf(dst, dst_len, "esp32c3-%02X%02X%02X%02X%02X%02X",
                 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    } else {
        snprintf(dst, dst_len, "esp32c3-unknown");
    }
}

static void sanitize_id_copy(char *dst, size_t dst_len, const char *src, const char *prefix, int ordinal)
{
    size_t wr = 0;
    if (!dst || dst_len == 0) {
        return;
    }

    if (src) {
        for (size_t i = 0; src[i] != 0 && wr + 1 < dst_len; ++i) {
            char ch = src[i];
            bool ok = ((ch >= 'a' && ch <= 'z') ||
                       (ch >= 'A' && ch <= 'Z') ||
                       (ch >= '0' && ch <= '9') ||
                       ch == '_' || ch == '-');
            if (ok) {
                dst[wr++] = ch;
            }
        }
    }

    if (wr == 0) {
        snprintf(dst, dst_len, "%s%d", prefix, ordinal);
    } else {
        dst[wr] = 0;
    }
}

static const char *normalize_board_profile_value(const char *profile)
{
    if (!profile || profile[0] == 0) {
        return BOARD_PROFILE;
    }

    for (size_t i = 0; i < sizeof(s_board_gpio_policies) / sizeof(s_board_gpio_policies[0]); ++i) {
        if (strcmp(s_board_gpio_policies[i].profile, profile) == 0) {
            return s_board_gpio_policies[i].profile;
        }
    }

    return BOARD_PROFILE;
}

static const board_gpio_policy_t *get_board_gpio_policy(const char *profile)
{
    const char *normalized = normalize_board_profile_value(profile);
    for (size_t i = 0; i < sizeof(s_board_gpio_policies) / sizeof(s_board_gpio_policies[0]); ++i) {
        if (strcmp(s_board_gpio_policies[i].profile, normalized) == 0) {
            return &s_board_gpio_policies[i];
        }
    }

    return &s_board_gpio_policies[0];
}

