klactrafob/esp32-c3_matter/src/core/cfg_json.c
static bool is_valid_ws2812_color_order(const char *value)
{
    static const char *const k_orders[] = {
        "RGB", "RBG", "GRB", "GBR", "BRG", "BGR",
    };

    if (!value || value[0] == 0) {
        return false;
    }

    for (size_t i = 0; i < sizeof(k_orders) / sizeof(k_orders[0]); ++i) {
        if (strcmp(value, k_orders[i]) == 0) {
            return true;
        }
    }

    return false;
}

static const char *normalize_ws2812_mode(const char *value)
{
    if (value && strcmp(value, "mono_triplet") == 0) {
        return "mono_triplet";
    }
    return "rgb";
}

static const char *normalize_ws2812_transition_style(const char *value)
{
    if (value && strcmp(value, "fade") == 0) {
        return "fade";
    }
    if (value && strcmp(value, "wipe") == 0) {
        return "wipe";
    }
    return "none";
}

static const char *normalize_pull_value(const char *value)
{
    if (value && strcmp(value, "down") == 0) {
        return "down";
    }
    if (value && strcmp(value, "none") == 0) {
        return "none";
    }
    return "up";
}

static const char *normalize_stepper_role(const char *value)
{
    if (value && strcmp(value, "cover") == 0) {
        return "cover";
    }
    return "generic";
}

static const char *normalize_output_mqtt_component(const char *value)
{
    if (value && strcmp(value, "number") == 0) {
        return "number";
    }
    if (value && strcmp(value, "light") == 0) {
        return "light";
    }
    if (value && strcmp(value, "cover") == 0) {
        return "cover";
    }
    return "auto";
}

static const char *normalize_output_mqtt_number_mode(const char *value)
{
    if (value && strcmp(value, "box") == 0) {
        return "box";
    }
    if (value && strcmp(value, "auto") == 0) {
        return "auto";
    }
    return "slider";
}

static bool is_adc_feedback_gpio(int gpio)
{
    return gpio == 0 || gpio == 1 || gpio == 2 || gpio == 3 || gpio == 4;
}

static bool is_gpio_allowed_for_profile(const char *profile, int gpio)
{
    const board_gpio_policy_t *policy = get_board_gpio_policy(profile);
    for (size_t i = 0; i < policy->gpio_count; ++i) {
        if (policy->gpios[i] == gpio) {
            return true;
        }
    }
    return false;
}

static bool id_already_used(cfg_validation_t *ctx, const char *id)
{
    for (int i = 0; i < ctx->id_count; ++i) {
        if (strcmp(ctx->ids[i], id) == 0) {
            return true;
        }
    }
    return false;
}

static bool register_id(cfg_validation_t *ctx, const char *id)
{
    if (!id || !id[0]) {
        set_error("Entity id is empty");
        return false;
    }
    if (id_already_used(ctx, id)) {
        set_error("Duplicate entity id: %s", id);
        return false;
    }
    if (ctx->id_count >= (int)(sizeof(ctx->ids) / sizeof(ctx->ids[0]))) {
        set_error("Too many entities in config");
        return false;
    }
    snprintf(ctx->ids[ctx->id_count], sizeof(ctx->ids[ctx->id_count]), "%s", id);
    ctx->id_count++;
    return true;
}

static bool reserve_gpio(cfg_validation_t *ctx, int gpio, const char *owner, const char *share_group)
{
    if (gpio < 0 || gpio >= (int)(sizeof(ctx->pins) / sizeof(ctx->pins[0]))) {
        set_error("%s uses invalid GPIO%d", owner, gpio);
        return false;
    }
    if (!is_gpio_allowed_for_profile(ctx->board_profile, gpio)) {
        set_error("%s uses forbidden GPIO%d for board profile %s", owner, gpio, ctx->board_profile);
        return false;
    }

    gpio_reservation_t *slot = &ctx->pins[gpio];
    if (!slot->used) {
        slot->used = true;
        snprintf(slot->group, sizeof(slot->group), "%s", share_group ? share_group : "");
        snprintf(slot->owner, sizeof(slot->owner), "%s", owner);
        return true;
    }

    if (share_group && share_group[0] != 0 && strcmp(slot->group, share_group) == 0) {
        return true;
    }

    set_error("GPIO%d conflict between %s and %s", gpio, owner, slot->owner);
    return false;
}

static bool reserve_ledc_channel(cfg_validation_t *ctx, const char *owner, int freq_hz)
{
    int timer_index = -1;

    if (!ctx || !owner || freq_hz <= 0) {
        set_error("Invalid LEDC reservation request");
        return false;
    }

    for (int i = 0; i < ctx->ledc_timer_count; ++i) {
        if (ctx->ledc_timers[i].used && ctx->ledc_timers[i].freq_hz == freq_hz) {
            timer_index = i;
            break;
        }
    }

    if (timer_index < 0) {
        if (ctx->ledc_timer_count >= SOC_LEDC_TIMER_NUM) {
            set_error("%s requires too many LEDC timers/frequencies: max %d", owner, SOC_LEDC_TIMER_NUM);
            return false;
        }
        timer_index = ctx->ledc_timer_count++;
        ctx->ledc_timers[timer_index].used = true;
        ctx->ledc_timers[timer_index].freq_hz = freq_hz;
    }

    if (ctx->ledc_channel_count >= SOC_LEDC_CHANNEL_NUM) {
        set_error("%s requires too many LEDC channels: max %d", owner, SOC_LEDC_CHANNEL_NUM);
        return false;
    }

    ctx->ledc_channel_count++;
    return true;
}

static int rmt_blocks_for_symbols(int mem_block_symbols)
{
    int blocks = mem_block_symbols / SOC_RMT_MEM_WORDS_PER_CHANNEL;
    if (blocks * SOC_RMT_MEM_WORDS_PER_CHANNEL < mem_block_symbols) {
        blocks++;
    }
    return blocks;
}

static bool reserve_rmt_blocks(cfg_validation_t *ctx, const char *owner, int tx_blocks, int rx_blocks)
{
    const int max_tx_blocks = (int)(SOC_RMT_GROUPS * SOC_RMT_TX_CANDIDATES_PER_GROUP);
    const int max_rx_blocks = (int)(SOC_RMT_GROUPS * SOC_RMT_RX_CANDIDATES_PER_GROUP);

    if (!ctx || !owner || tx_blocks < 0 || rx_blocks < 0) {
        set_error("Invalid RMT reservation request");
        return false;
    }

    if (ctx->rmt_tx_blocks_used + tx_blocks > max_tx_blocks) {
        set_error("%s exceeds available RMT TX blocks: need %d more, max %d",
                  owner, tx_blocks, max_tx_blocks);
        return false;
    }
    if (ctx->rmt_rx_blocks_used + rx_blocks > max_rx_blocks) {
        set_error("%s exceeds available RMT RX blocks: need %d more, max %d",
                  owner, rx_blocks, max_rx_blocks);
        return false;
    }

    ctx->rmt_tx_blocks_used += tx_blocks;
    ctx->rmt_rx_blocks_used += rx_blocks;
    return true;
}

