klactrafob/esp32-c3_matter/src/core/cfg_json.c
static cJSON *create_empty_schema(void)
{
    cJSON *root = cJSON_CreateObject();
    char node_id[40] = {0};
    build_board_node_id(node_id, sizeof(node_id));

    cJSON_AddNumberToObject(root, "schema_version", CFG_SCHEMA_VERSION);

    cJSON *device = cJSON_AddObjectToObject(root, "device");
    cJSON_AddStringToObject(device, "name", DEVICE_NAME_DEFAULT);
    cJSON_AddStringToObject(device, "board_profile", BOARD_PROFILE);
    cJSON_AddStringToObject(device, "node_id", node_id);

    cJSON *connectivity = cJSON_AddObjectToObject(root, "connectivity");

    cJSON *ap = cJSON_AddObjectToObject(connectivity, "ap");
    cJSON_AddStringToObject(ap, "ssid", AP_SSID_DEFAULT);
    cJSON_AddStringToObject(ap, "pass", "");

    cJSON *sta = cJSON_AddObjectToObject(connectivity, "sta");
    cJSON_AddStringToObject(sta, "ssid", "");
    cJSON_AddStringToObject(sta, "pass", "");

    cJSON *mqtt = cJSON_AddObjectToObject(connectivity, "mqtt");
    cJSON_AddBoolToObject(mqtt, "enable", false);
    cJSON_AddStringToObject(mqtt, "host", "");
    cJSON_AddNumberToObject(mqtt, "port", 1883);
    cJSON_AddStringToObject(mqtt, "user", "");
    cJSON_AddStringToObject(mqtt, "pass", "");
    cJSON_AddStringToObject(mqtt, "client_id", node_id);
    cJSON_AddStringToObject(mqtt, "topic_prefix", node_id);
    cJSON_AddStringToObject(mqtt, "discovery_prefix", MQTT_DISCOVERY_PREFIX_DEFAULT);
    cJSON_AddBoolToObject(mqtt, "discovery", true);
    cJSON_AddBoolToObject(mqtt, "retain", true);

    cJSON *web = cJSON_AddObjectToObject(root, "web");
    cJSON *auth = cJSON_AddObjectToObject(web, "auth");
    cJSON_AddBoolToObject(auth, "enable", false);
    cJSON_AddStringToObject(auth, "password", "");

    cJSON_AddArrayToObject(root, "outputs");
    cJSON_AddArrayToObject(root, "inputs");
    cJSON_AddArrayToObject(root, "buttons");
    cJSON_AddArrayToObject(root, "sensors");

    return root;
}

static cJSON *normalize_cleanup_and_fail(cJSON *root, cfg_validation_t *ctx)
{
    free(ctx);
    cJSON_Delete(root);
    return NULL;
}

static cJSON *normalize_cleanup_success(cJSON *root, cfg_validation_t *ctx)
{
    free(ctx);
    return root;
}

static bool append_action_json(cJSON *dst_parent, const char *key, const cJSON *src_action)
{
    cJSON *dst = cJSON_AddObjectToObject(dst_parent, key);
    if (!dst) {
        return false;
    }

    const char *type = jstr(src_action, "type", "none");
    if (type[0] == 0) {
        type = "none";
    }
    cJSON_AddStringToObject(dst, "type", type);

    const char *target = jstr(src_action, "target", "");
    if (target[0] != 0) {
        cJSON_AddStringToObject(dst, "target", target);
    }

    if (strcmp(type, "set_output") == 0) {
        cJSON_AddBoolToObject(dst, "value", jbool(src_action, "value", false));
    } else if (strcmp(type, "dim_step_up") == 0 || strcmp(type, "dim_step_down") == 0) {
        int step = jint(src_action, "step", 10);
        if (step < 1) {
            step = 1;
        }
        if (step > 100) {
            step = 100;
        }
        cJSON_AddNumberToObject(dst, "step", step);
    }

    return true;
}

static cJSON *normalize_config(const cJSON *src)
{
    cJSON *root = create_empty_schema();
    if (!root) {
        set_error("Out of memory while creating config");
        return NULL;
    }

    char node_id[40] = {0};
    build_board_node_id(node_id, sizeof(node_id));

    const cJSON *src_device = jobj(src, "device");
    const cJSON *src_conn = get_connectivity_obj(src);
    const cJSON *src_ap = jobj(src_conn, "ap");
    const cJSON *src_sta = jobj(src_conn, "sta");
    const cJSON *src_mqtt = get_mqtt_obj(src);
    const cJSON *src_web = jobj(src, "web");
    const cJSON *src_web_auth = jobj(src_web, "auth");

    cJSON *device = cJSON_GetObjectItemCaseSensitive(root, "device");
    cJSON *connectivity = cJSON_GetObjectItemCaseSensitive(root, "connectivity");
    cJSON *ap = cJSON_GetObjectItemCaseSensitive(connectivity, "ap");
    cJSON *sta = cJSON_GetObjectItemCaseSensitive(connectivity, "sta");
    cJSON *mqtt = cJSON_GetObjectItemCaseSensitive(connectivity, "mqtt");
    cJSON *outputs = cJSON_GetObjectItemCaseSensitive(root, "outputs");
    cJSON *inputs = cJSON_GetObjectItemCaseSensitive(root, "inputs");
    cJSON *buttons = cJSON_GetObjectItemCaseSensitive(root, "buttons");
    cJSON *sensors = cJSON_GetObjectItemCaseSensitive(root, "sensors");
    cJSON *web = cJSON_GetObjectItemCaseSensitive(root, "web");
    cJSON *web_auth = cJSON_GetObjectItemCaseSensitive(web, "auth");

    const char *device_name = jstr(src_device, "name",
                                   jstr(src_mqtt, "device_name", DEVICE_NAME_DEFAULT));
    const char *board_profile = normalize_board_profile_value(
        jstr(src_device, "board_profile", BOARD_PROFILE));
    const char *saved_node_id = jstr(src_device, "node_id", node_id);
    if (!saved_node_id[0]) {
        saved_node_id = node_id;
    }

    cJSON_ReplaceItemInObject(device, "name", cJSON_CreateString(device_name));
    cJSON_ReplaceItemInObject(device, "board_profile", cJSON_CreateString(board_profile));
    cJSON_ReplaceItemInObject(device, "node_id", cJSON_CreateString(saved_node_id));

    cJSON_ReplaceItemInObject(ap, "ssid", cJSON_CreateString(jstr(src_ap, "ssid", AP_SSID_DEFAULT)));
    cJSON_ReplaceItemInObject(ap, "pass", cJSON_CreateString(jstr(src_ap, "pass", "")));
    cJSON_ReplaceItemInObject(sta, "ssid", cJSON_CreateString(jstr(src_sta, "ssid", "")));
    cJSON_ReplaceItemInObject(sta, "pass", cJSON_CreateString(jstr(src_sta, "pass", "")));

    cJSON_ReplaceItemInObject(mqtt, "enable", cJSON_CreateBool(jbool(src_mqtt, "enable", false)));
    cJSON_ReplaceItemInObject(mqtt, "host",
                              cJSON_CreateString(jstr_alias(src_mqtt, "host", "server_ip", "")));
    cJSON_ReplaceItemInObject(mqtt, "port",
                              cJSON_CreateNumber(jint_alias(src_mqtt, "port", "server_port", 1883)));
    cJSON_ReplaceItemInObject(mqtt, "user",
                              cJSON_CreateString(jstr_alias(src_mqtt, "user", "login", "")));
    cJSON_ReplaceItemInObject(mqtt, "pass",
                              cJSON_CreateString(jstr_alias(src_mqtt, "pass", "password", "")));
    cJSON_ReplaceItemInObject(mqtt, "client_id",
                              cJSON_CreateString(jstr(src_mqtt, "client_id", saved_node_id)));
    cJSON_ReplaceItemInObject(mqtt, "topic_prefix",
                              cJSON_CreateString(jstr(src_mqtt, "topic_prefix", saved_node_id)));
    cJSON_ReplaceItemInObject(mqtt, "discovery_prefix",
                              cJSON_CreateString(jstr(src_mqtt, "discovery_prefix",
                                                      MQTT_DISCOVERY_PREFIX_DEFAULT)));
    cJSON_ReplaceItemInObject(mqtt, "discovery", cJSON_CreateBool(jbool(src_mqtt, "discovery", true)));
    cJSON_ReplaceItemInObject(mqtt, "retain", cJSON_CreateBool(jbool(src_mqtt, "retain", true)));
    cJSON_ReplaceItemInObject(web_auth, "enable", cJSON_CreateBool(jbool(src_web_auth, "enable", false)));
    cJSON_ReplaceItemInObject(web_auth, "password", cJSON_CreateString(jstr(src_web_auth, "password", "")));

