klactrafob/esp32-c3_matter/src/core/cfg_json.c
    cfg_validation_t *ctx = calloc(1, sizeof(*ctx));
    if (!ctx) {
        cJSON_Delete(root);
        set_error("Out of memory while validating config");
        return NULL;
    }
    snprintf(ctx->board_profile, sizeof(ctx->board_profile), "%s", board_profile);

    const cJSON *src_outputs = jobj(src, "outputs");
    if (cJSON_IsArray((cJSON *)src_outputs)) {
        int count = cJSON_GetArraySize((cJSON *)src_outputs);
        if (count > CFG_MAX_OUTPUTS) {
            set_error("Too many outputs: max %d", CFG_MAX_OUTPUTS);
            return normalize_cleanup_and_fail(root, ctx);
        }

        for (int i = 0; i < count; ++i) {
            const cJSON *item = cJSON_GetArrayItem((cJSON *)src_outputs, i);
            if (!cJSON_IsObject((cJSON *)item)) {
                continue;
            }

            char id[24] = {0};
            sanitize_id_copy(id, sizeof(id), jstr(item, "id", ""), "out", i + 1);
            if (!register_id(ctx, id)) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            const char *type = jstr(item, "type", "relay");
            if (strcmp(type, "relay") != 0 &&
                strcmp(type, "pwm") != 0 &&
                strcmp(type, "ws2812") != 0 &&
                strcmp(type, "servo_3wire") != 0 &&
                strcmp(type, "servo_5wire") != 0 &&
                strcmp(type, "clock_4x4094") != 0 &&
                strcmp(type, "stepper_28byj") != 0 &&
                strcmp(type, "stepper_a4988") != 0) {
                set_error("Output %s uses unsupported type '%s'", id, type);
                return normalize_cleanup_and_fail(root, ctx);
            }

            int gpio = jint(item, "gpio", -1);
            char owner[40] = {0};
            snprintf(owner, sizeof(owner), "output:%s", id);
            if (!reserve_gpio(ctx, gpio, owner, "")) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            cJSON *dst = cJSON_CreateObject();
            bool enabled = jbool(item, "enabled", true);
            cJSON_AddStringToObject(dst, "id", id);
            cJSON_AddStringToObject(dst, "name", jstr(item, "name", id));
            cJSON_AddStringToObject(dst, "type", type);
            cJSON_AddBoolToObject(dst, "enabled", enabled);
            cJSON_AddNumberToObject(dst, "gpio", gpio);

            if (strcmp(type, "relay") == 0) {
                cJSON_AddNumberToObject(dst, "active_level", jint(item, "active_level", 1) ? 1 : 0);
                cJSON_AddBoolToObject(dst, "default_on", jbool(item, "default_on", false));
            } else if (strcmp(type, "pwm") == 0) {
                int freq = jint(item, "freq_hz", 1000);
                int default_level = jint(item, "default_level", 0);
                int max_level_pct = jint(item, "max_level_pct", 100);
                int power_relay_gpio = jint(item, "power_relay_gpio", -1);
                int power_relay_active_level = jint(item, "power_relay_active_level", 1) ? 1 : 0;
                if (freq < 100) {
                    freq = 100;
                }
                if (freq > 20000) {
                    freq = 20000;
                }
                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (max_level_pct < 1) {
                    max_level_pct = 1;
                }
                if (max_level_pct > 100) {
                    max_level_pct = 100;
                }
                if (power_relay_gpio >= 0) {
                    char relay_owner[40] = {0};
                    snprintf(relay_owner, sizeof(relay_owner), "pwm-power-relay:%s", id);
                    if (!reserve_gpio(ctx, power_relay_gpio, relay_owner, "")) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }
                if (enabled) {
                    char ledc_owner[40] = {0};
                    snprintf(ledc_owner, sizeof(ledc_owner), "pwm:%s", id);
                    if (!reserve_ledc_channel(ctx, ledc_owner, freq)) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }
                cJSON_AddNumberToObject(dst, "freq_hz", freq);
                cJSON_AddBoolToObject(dst, "inverted", jbool(item, "inverted", false));
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "max_level_pct", max_level_pct);
                if (power_relay_gpio >= 0) {
                    cJSON_AddNumberToObject(dst, "power_relay_gpio", power_relay_gpio);
                    cJSON_AddNumberToObject(dst, "power_relay_active_level", power_relay_active_level);
                }
            } else if (strcmp(type, "ws2812") == 0) {
                int pixel_count = jint(item, "pixel_count", 1);
                int transition_ms = jint(item, "transition_ms", 300);
                const char *mode = normalize_ws2812_mode(jstr(item, "mode", "rgb"));
                const char *transition_style = normalize_ws2812_transition_style(
                    jstr(item, "transition_style", "none"));
                const char *color_order = jstr(item, "color_order", "GRB");
                if (pixel_count < 1) {
                    pixel_count = 1;
                }
                if (pixel_count > 300) {
                    pixel_count = 300;
                }
                if (transition_ms < 0) {
                    transition_ms = 0;
                }
                if (transition_ms > 5000) {
                    transition_ms = 5000;
                }
                if (!is_valid_ws2812_color_order(color_order)) {
                    color_order = "GRB";
                }
                if (enabled) {
                    char rmt_owner[40] = {0};
                    snprintf(rmt_owner, sizeof(rmt_owner), "ws2812:%s", id);
                    if (!reserve_rmt_blocks(ctx, rmt_owner, 1, 0)) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }
                cJSON_AddNumberToObject(dst, "pixel_count", pixel_count);
                cJSON_AddStringToObject(dst, "mode", mode);
                cJSON_AddStringToObject(dst, "color_order", color_order);
                cJSON_AddStringToObject(dst, "transition_style", transition_style);
                cJSON_AddNumberToObject(dst, "transition_ms", transition_ms);
                cJSON_AddBoolToObject(dst, "default_power_on", jbool(item, "default_power_on", false));
                cJSON_AddBoolToObject(dst, "gamma_correction", jbool(item, "gamma_correction", false));
            } else if (strcmp(type, "servo_3wire") == 0) {
                int default_level = jint(item, "default_level", 0);
                int min_us = jint(item, "min_us", 500);
                int max_us = jint(item, "max_us", 2500);
                int hold_power_ms = jint(item, "hold_power_ms", SERVO_3WIRE_HOLD_MS_DEFAULT);
                bool reverse_direction = jbool(item, "reverse_direction", false);
                const char *mqtt_component = normalize_output_mqtt_component(jstr(item, "mqtt_component", "auto"));
                const char *mqtt_number_mode =
                    normalize_output_mqtt_number_mode(jstr(item, "mqtt_number_mode", "slider"));
                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (min_us < 400) {
                    min_us = 400;
                }
                if (max_us > 2600) {
                    max_us = 2600;
                }
                if (max_us <= min_us) {
                    max_us = min_us + 100;
                }
                if (hold_power_ms < 0) {
                    hold_power_ms = 0;
                }
                if (hold_power_ms > 10000) {
                    hold_power_ms = 10000;
                }
                if (enabled) {
                    char ledc_owner[40] = {0};
                    snprintf(ledc_owner, sizeof(ledc_owner), "servo3:%s", id);
                    if (!reserve_ledc_channel(ctx, ledc_owner, 50)) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "min_us", min_us);
                cJSON_AddNumberToObject(dst, "max_us", max_us);
                cJSON_AddNumberToObject(dst, "hold_power_ms", hold_power_ms);
                cJSON_AddBoolToObject(dst, "reverse_direction", reverse_direction);
                cJSON_AddStringToObject(dst, "mqtt_component", mqtt_component);
                cJSON_AddStringToObject(dst, "mqtt_number_mode", mqtt_number_mode);
            } else if (strcmp(type, "servo_5wire") == 0) {
                int gpio_b = jint(item, "gpio_b", -1);
                int feedback_gpio = jint(item, "feedback_gpio", -1);
                int default_level = jint(item, "default_level", 0);
                int feedback_min_raw = jint(item, "feedback_min_raw", 300);
                int feedback_max_raw = jint(item, "feedback_max_raw", 3700);
                int deadband_pct = jint(item, "deadband_pct", 2);
                int move_timeout_ms = jint(item, "move_timeout_ms", 15000);
                const char *mqtt_component = normalize_output_mqtt_component(jstr(item, "mqtt_component", "auto"));
                const char *mqtt_number_mode =
                    normalize_output_mqtt_number_mode(jstr(item, "mqtt_number_mode", "slider"));

                char owner_b[40] = {0};
                char owner_fb[40] = {0};
                snprintf(owner_b, sizeof(owner_b), "servo5-b:%s", id);
                snprintf(owner_fb, sizeof(owner_fb), "servo5-feedback:%s", id);

                if (!reserve_gpio(ctx, gpio_b, owner_b, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (!reserve_gpio(ctx, feedback_gpio, owner_fb, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (!is_adc_feedback_gpio(feedback_gpio)) {
                    set_error("Output %s uses GPIO%d for feedback, but only ADC-capable GPIO0..GPIO4 are supported",
                              id, feedback_gpio);
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (deadband_pct < 1) {
                    deadband_pct = 1;
                }
                if (deadband_pct > 20) {
                    deadband_pct = 20;
                }
                if (move_timeout_ms < 1000) {
                    move_timeout_ms = 1000;
                }
                if (move_timeout_ms > 60000) {
                    move_timeout_ms = 60000;
                }
                if (feedback_min_raw == feedback_max_raw) {
                    feedback_max_raw = feedback_min_raw + 100;
                }

                cJSON_AddNumberToObject(dst, "gpio_b", gpio_b);
                cJSON_AddNumberToObject(dst, "feedback_gpio", feedback_gpio);
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "feedback_min_raw", feedback_min_raw);
                cJSON_AddNumberToObject(dst, "feedback_max_raw", feedback_max_raw);
                cJSON_AddNumberToObject(dst, "deadband_pct", deadband_pct);
                cJSON_AddNumberToObject(dst, "move_timeout_ms", move_timeout_ms);
                cJSON_AddBoolToObject(dst, "reverse_direction", jbool(item, "reverse_direction", false));
                cJSON_AddStringToObject(dst, "mqtt_component", mqtt_component);
                cJSON_AddStringToObject(dst, "mqtt_number_mode", mqtt_number_mode);
            } else if (strcmp(type, "clock_4x4094") == 0) {
                int gpio_b = jint(item, "gpio_b", -1);
                int gpio_c = jint(item, "gpio_c", -1);
                int brightness_gpio = jint(item, "brightness_gpio", -1);
                int default_level = jint(item, "default_level", 100);
                int blink_period_ms = jint(item, "blink_period_ms", 2000);
                int timezone_offset_min = jint(item, "timezone_offset_min", 0);
                int segment_map[8] = {
                    jint(item, "segment_a", 1),
                    jint(item, "segment_b", 2),
                    jint(item, "segment_c", 3),
                    jint(item, "segment_d", 4),
                    jint(item, "segment_e", 5),
                    jint(item, "segment_f", 6),
                    jint(item, "segment_g", 7),
                    jint(item, "segment_dp", 8),
                };
                bool segment_seen[8] = {false};
                bool segment_map_valid = true;

                char owner_b[40] = {0};
                char owner_c[40] = {0};
                char owner_pwm[40] = {0};
                snprintf(owner_b, sizeof(owner_b), "clock4094-clk:%s", id);
                snprintf(owner_c, sizeof(owner_c), "clock4094-latch:%s", id);
                snprintf(owner_pwm, sizeof(owner_pwm), "clk4094-br:%s", id);

                if (!reserve_gpio(ctx, gpio_b, owner_b, "") ||
                    !reserve_gpio(ctx, gpio_c, owner_c, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (brightness_gpio >= 0 && !reserve_gpio(ctx, brightness_gpio, owner_pwm, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (enabled && brightness_gpio >= 0) {
                    char ledc_owner[40] = {0};
                    snprintf(ledc_owner, sizeof(ledc_owner), "clock4094:%s", id);
                    if (!reserve_ledc_channel(ctx, ledc_owner, 1000)) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }

                if (timezone_offset_min < -720) {
                    timezone_offset_min = -720;
                }
                if (timezone_offset_min > 840) {
                    timezone_offset_min = 840;
                }
                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (blink_period_ms < 200) {
                    blink_period_ms = 200;
                }
                if (blink_period_ms > 10000) {
                    blink_period_ms = 10000;
                }
                for (int seg = 0; seg < 8; ++seg) {
                    if (segment_map[seg] < 1 || segment_map[seg] > 8 ||
                        segment_seen[segment_map[seg] - 1]) {
                        segment_map_valid = false;
                        break;
                    }
                    segment_seen[segment_map[seg] - 1] = true;
                }
                if (!segment_map_valid) {
                    for (int seg = 0; seg < 8; ++seg) {
                        segment_map[seg] = seg + 1;
                    }
                }

                cJSON_AddNumberToObject(dst, "gpio_b", gpio_b);
                cJSON_AddNumberToObject(dst, "gpio_c", gpio_c);
                if (brightness_gpio >= 0) {
                    cJSON_AddNumberToObject(dst, "brightness_gpio", brightness_gpio);
                }
                cJSON_AddBoolToObject(dst, "default_on", jbool(item, "default_on", true));
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "blink_period_ms", blink_period_ms);
                cJSON_AddNumberToObject(dst, "timezone_offset_min", timezone_offset_min);
                cJSON_AddBoolToObject(dst, "common_anode", jbool(item, "common_anode", false));
                cJSON_AddBoolToObject(dst, "mirror_segments", jbool(item, "mirror_segments", true));
                cJSON_AddBoolToObject(dst, "reverse_digits", jbool(item, "reverse_digits", false));
                cJSON_AddBoolToObject(dst, "leading_zero", jbool(item, "leading_zero", true));
                cJSON_AddBoolToObject(dst, "blink_separator", jbool(item, "blink_separator", true));
                cJSON_AddNumberToObject(dst, "segment_a", segment_map[0]);
                cJSON_AddNumberToObject(dst, "segment_b", segment_map[1]);
                cJSON_AddNumberToObject(dst, "segment_c", segment_map[2]);
                cJSON_AddNumberToObject(dst, "segment_d", segment_map[3]);
                cJSON_AddNumberToObject(dst, "segment_e", segment_map[4]);
                cJSON_AddNumberToObject(dst, "segment_f", segment_map[5]);
                cJSON_AddNumberToObject(dst, "segment_g", segment_map[6]);
                cJSON_AddNumberToObject(dst, "segment_dp", segment_map[7]);
            } else if (strcmp(type, "stepper_28byj") == 0) {
                int gpio_b = jint(item, "gpio_b", -1);
                int gpio_c = jint(item, "gpio_c", -1);
                int gpio_d = jint(item, "gpio_d", -1);
                int home_gpio = jint(item, "home_gpio", -1);
                int default_level = jint(item, "default_level", 0);
                int steps_range = jint(item, "steps_range", 2048);
                int speed_steps_per_sec = jint(item, "speed_steps_per_sec", 400);
                const char *home_pull = normalize_pull_value(jstr(item, "home_pull", "up"));
                const char *role = normalize_stepper_role(jstr(item, "role", "generic"));

                char owner_b[40] = {0};
                char owner_c[40] = {0};
                char owner_d[40] = {0};
                char owner_home[40] = {0};
                snprintf(owner_b, sizeof(owner_b), "stepper28-b:%s", id);
                snprintf(owner_c, sizeof(owner_c), "stepper28-c:%s", id);
                snprintf(owner_d, sizeof(owner_d), "stepper28-d:%s", id);
                snprintf(owner_home, sizeof(owner_home), "stepper28-home:%s", id);

                if (!reserve_gpio(ctx, gpio_b, owner_b, "") ||
                    !reserve_gpio(ctx, gpio_c, owner_c, "") ||
                    !reserve_gpio(ctx, gpio_d, owner_d, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (home_gpio >= 0 && !reserve_gpio(ctx, home_gpio, owner_home, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }

