klactrafob/esp32-c3_matter/src/core/cfg_json.c
                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (steps_range < 32) {
                    steps_range = 32;
                }
                if (steps_range > 200000) {
                    steps_range = 200000;
                }
                if (speed_steps_per_sec < 10) {
                    speed_steps_per_sec = 10;
                }
                if (speed_steps_per_sec > 1500) {
                    speed_steps_per_sec = 1500;
                }

                cJSON_AddStringToObject(dst, "role", role);
                cJSON_AddNumberToObject(dst, "gpio_b", gpio_b);
                cJSON_AddNumberToObject(dst, "gpio_c", gpio_c);
                cJSON_AddNumberToObject(dst, "gpio_d", gpio_d);
                if (home_gpio >= 0) {
                    cJSON_AddNumberToObject(dst, "home_gpio", home_gpio);
                    cJSON_AddStringToObject(dst, "home_pull", home_pull);
                }
                cJSON_AddBoolToObject(dst, "home_inverted", jbool(item, "home_inverted", false));
                cJSON_AddBoolToObject(dst, "auto_home_on_boot", jbool(item, "auto_home_on_boot", false));
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "steps_range", steps_range);
                cJSON_AddNumberToObject(dst, "speed_steps_per_sec", speed_steps_per_sec);
                cJSON_AddBoolToObject(dst, "reverse_direction", jbool(item, "reverse_direction", false));
                cJSON_AddBoolToObject(dst, "hold_enabled", jbool(item, "hold_enabled", false));
            } else if (strcmp(type, "stepper_a4988") == 0) {
                int gpio_b = jint(item, "gpio_b", -1);
                int gpio_c = jint(item, "gpio_c", -1);
                int home_gpio = jint(item, "home_gpio", -1);
                int enable_active_level = jint(item, "enable_active_level", 0) ? 1 : 0;
                int default_level = jint(item, "default_level", 0);
                int steps_range = jint(item, "steps_range", 200);
                int speed_steps_per_sec = jint(item, "speed_steps_per_sec", 800);
                int step_pulse_us = jint(item, "step_pulse_us", 4);
                const char *home_pull = normalize_pull_value(jstr(item, "home_pull", "up"));
                const char *role = normalize_stepper_role(jstr(item, "role", "generic"));

                char owner_b[40] = {0};
                char owner_c[40] = {0};
                char owner_home[40] = {0};
                snprintf(owner_b, sizeof(owner_b), "steppera-dir:%s", id);
                snprintf(owner_c, sizeof(owner_c), "steppera-en:%s", id);
                snprintf(owner_home, sizeof(owner_home), "steppera-home:%s", id);

                if (!reserve_gpio(ctx, gpio_b, owner_b, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (gpio_c >= 0 && !reserve_gpio(ctx, gpio_c, owner_c, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (home_gpio >= 0 && !reserve_gpio(ctx, home_gpio, owner_home, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }

                if (default_level < 0) {
                    default_level = 0;
                }
                if (default_level > 100) {
                    default_level = 100;
                }
                if (steps_range < 32) {
                    steps_range = 32;
                }
                if (steps_range > 200000) {
                    steps_range = 200000;
                }
                if (speed_steps_per_sec < 10) {
                    speed_steps_per_sec = 10;
                }
                if (speed_steps_per_sec > 20000) {
                    speed_steps_per_sec = 20000;
                }
                if (step_pulse_us < 2) {
                    step_pulse_us = 2;
                }
                if (step_pulse_us > 20) {
                    step_pulse_us = 20;
                }

                cJSON_AddStringToObject(dst, "role", role);
                cJSON_AddNumberToObject(dst, "gpio_b", gpio_b);
                if (gpio_c >= 0) {
                    cJSON_AddNumberToObject(dst, "gpio_c", gpio_c);
                    cJSON_AddNumberToObject(dst, "enable_active_level", enable_active_level);
                }
                if (home_gpio >= 0) {
                    cJSON_AddNumberToObject(dst, "home_gpio", home_gpio);
                    cJSON_AddStringToObject(dst, "home_pull", home_pull);
                }
                cJSON_AddBoolToObject(dst, "home_inverted", jbool(item, "home_inverted", false));
                cJSON_AddBoolToObject(dst, "auto_home_on_boot", jbool(item, "auto_home_on_boot", false));
                cJSON_AddNumberToObject(dst, "default_level", default_level);
                cJSON_AddNumberToObject(dst, "steps_range", steps_range);
                cJSON_AddNumberToObject(dst, "speed_steps_per_sec", speed_steps_per_sec);
                cJSON_AddNumberToObject(dst, "step_pulse_us", step_pulse_us);
                cJSON_AddBoolToObject(dst, "reverse_direction", jbool(item, "reverse_direction", false));
                cJSON_AddBoolToObject(dst, "hold_enabled", jbool(item, "hold_enabled", false));
            }

            cJSON_AddItemToArray(outputs, dst);
        }
    } else {
        const cJSON *legacy_modules = jobj(src, "modules");
        const cJSON *legacy_relay = jobj(legacy_modules, "relay");
        if (cJSON_IsObject((cJSON *)legacy_relay) && jbool(legacy_relay, "enable", true)) {
            int gpio = jint(legacy_relay, "gpio", 4);
            if (!reserve_gpio(ctx, gpio, "output:relay1", "")) {
                return normalize_cleanup_and_fail(root, ctx);
            }
            if (!register_id(ctx, "relay1")) {
                return normalize_cleanup_and_fail(root, ctx);
            }
            cJSON *dst = cJSON_CreateObject();
            cJSON_AddStringToObject(dst, "id", "relay1");
            cJSON_AddStringToObject(dst, "name", "Relay 1");
            cJSON_AddStringToObject(dst, "type", "relay");
            cJSON_AddBoolToObject(dst, "enabled", true);
            cJSON_AddNumberToObject(dst, "gpio", gpio);
            cJSON_AddNumberToObject(dst, "active_level", jint(legacy_relay, "active_level", 1) ? 1 : 0);
            cJSON_AddBoolToObject(dst, "default_on", jbool(legacy_relay, "default_on", false));
            cJSON_AddItemToArray(outputs, dst);
        }
    }

