klactrafob/esp32-c3_matter/src/core/cfg_json.c
    const cJSON *src_inputs = jobj(src, "inputs");
    int input_count = 0;
    if (cJSON_IsArray((cJSON *)src_inputs)) {
        input_count = cJSON_GetArraySize((cJSON *)src_inputs);
        if (input_count > CFG_MAX_INPUTS_AND_BUTTONS) {
            set_error("Too many inputs: max %d", CFG_MAX_INPUTS_AND_BUTTONS);
            return normalize_cleanup_and_fail(root, ctx);
        }

        for (int i = 0; i < input_count; ++i) {
            const cJSON *item = cJSON_GetArrayItem((cJSON *)src_inputs, i);
            if (!cJSON_IsObject((cJSON *)item)) {
                continue;
            }

            char id[24] = {0};
            sanitize_id_copy(id, sizeof(id), jstr(item, "id", ""), "in", i + 1);
            if (!register_id(ctx, id)) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            int gpio = jint(item, "gpio", -1);
            char owner[40] = {0};
            snprintf(owner, sizeof(owner), "input:%s", id);
            if (!reserve_gpio(ctx, gpio, owner, "")) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            const char *role = jstr(item, "role", "generic_binary");
            if (strcmp(role, "motion") != 0 &&
                strcmp(role, "presence") != 0 &&
                strcmp(role, "contact") != 0 &&
                strcmp(role, "limit") != 0 &&
                strcmp(role, "generic_binary") != 0) {
                set_error("Input %s uses unsupported role '%s'", id, role);
                return normalize_cleanup_and_fail(root, ctx);
            }

            const char *pull = jstr(item, "pull", "up");
            if (strcmp(pull, "up") != 0 && strcmp(pull, "down") != 0 && strcmp(pull, "none") != 0) {
                set_error("Input %s uses unsupported pull '%s'", id, pull);
                return normalize_cleanup_and_fail(root, ctx);
            }

            cJSON *dst = cJSON_CreateObject();
            cJSON_AddStringToObject(dst, "id", id);
            cJSON_AddStringToObject(dst, "name", jstr(item, "name", id));
            cJSON_AddStringToObject(dst, "type", "digital");
            cJSON_AddBoolToObject(dst, "enabled", jbool(item, "enabled", true));
            cJSON_AddNumberToObject(dst, "gpio", gpio);
            cJSON_AddStringToObject(dst, "pull", pull);
            cJSON_AddBoolToObject(dst, "inverted", jbool(item, "inverted", false));
            cJSON_AddStringToObject(dst, "role", role);
            cJSON_AddItemToArray(inputs, dst);
        }
    }

    const cJSON *src_buttons = jobj(src, "buttons");
    int button_count = 0;
    if (cJSON_IsArray((cJSON *)src_buttons)) {
        button_count = cJSON_GetArraySize((cJSON *)src_buttons);
        if ((button_count + input_count) > CFG_MAX_INPUTS_AND_BUTTONS) {
            set_error("Too many inputs/buttons combined: max %d", CFG_MAX_INPUTS_AND_BUTTONS);
            return normalize_cleanup_and_fail(root, ctx);
        }

        for (int i = 0; i < button_count; ++i) {
            const cJSON *item = cJSON_GetArrayItem((cJSON *)src_buttons, i);
            if (!cJSON_IsObject((cJSON *)item)) {
                continue;
            }

            char id[24] = {0};
            sanitize_id_copy(id, sizeof(id), jstr(item, "id", ""), "btn", i + 1);
            if (!register_id(ctx, id)) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            int gpio = jint(item, "gpio", -1);
            char owner[40] = {0};
            snprintf(owner, sizeof(owner), "button:%s", id);
            if (!reserve_gpio(ctx, gpio, owner, "")) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            const char *pull = jstr(item, "pull", "up");
            if (strcmp(pull, "up") != 0 && strcmp(pull, "down") != 0 && strcmp(pull, "none") != 0) {
                set_error("Button %s uses unsupported pull '%s'", id, pull);
                return normalize_cleanup_and_fail(root, ctx);
            }

            cJSON *dst = cJSON_CreateObject();
            cJSON_AddStringToObject(dst, "id", id);
            cJSON_AddStringToObject(dst, "name", jstr(item, "name", id));
            cJSON_AddBoolToObject(dst, "enabled", jbool(item, "enabled", true));
            cJSON_AddNumberToObject(dst, "gpio", gpio);
            cJSON_AddStringToObject(dst, "pull", pull);
            cJSON_AddBoolToObject(dst, "inverted", jbool(item, "inverted", false));
            cJSON_AddNumberToObject(dst, "long_press_ms", jint(item, "long_press_ms", 1000));

            cJSON *actions = cJSON_AddObjectToObject(dst, "actions");
            const cJSON *src_actions = jobj(item, "actions");
            if (!append_action_json(actions, "short", jobj(src_actions, "short")) ||
                !append_action_json(actions, "long", jobj(src_actions, "long"))) {
                set_error("Out of memory while building button actions");
                return normalize_cleanup_and_fail(root, ctx);
            }

            cJSON_AddItemToArray(buttons, dst);
        }
    }

    const cJSON *src_sensors = jobj(src, "sensors");
    if (cJSON_IsArray((cJSON *)src_sensors)) {
        int count = cJSON_GetArraySize((cJSON *)src_sensors);
        int ds18b20_bus_count = 0;
        if (count > CFG_MAX_SENSORS) {
            set_error("Too many sensors: max %d", CFG_MAX_SENSORS);
            return normalize_cleanup_and_fail(root, ctx);
        }

        for (int i = 0; i < count; ++i) {
            const cJSON *item = cJSON_GetArrayItem((cJSON *)src_sensors, i);
            if (!cJSON_IsObject((cJSON *)item)) {
                continue;
            }

            char id[24] = {0};
            sanitize_id_copy(id, sizeof(id), jstr(item, "id", ""), "sensor", i + 1);
            if (!register_id(ctx, id)) {
                return normalize_cleanup_and_fail(root, ctx);
            }

            const char *type = jstr(item, "type", "");
            if (strcmp(type, "ds18b20_bus") != 0 &&
                strcmp(type, "aht20") != 0 &&
                strcmp(type, "sht3x") != 0 &&
                strcmp(type, "bme280") != 0) {
                set_error("Sensor %s uses unsupported type '%s'", id, type);
                return normalize_cleanup_and_fail(root, ctx);
            }

