klactrafob/esp32-c3_matter/src/core/cfg_json.c
            cJSON *dst = cJSON_CreateObject();
            cJSON_AddStringToObject(dst, "id", id);
            cJSON_AddStringToObject(dst, "name", jstr(item, "name", id));
            cJSON_AddStringToObject(dst, "type", type);
            cJSON_AddBoolToObject(dst, "enabled", jbool(item, "enabled", true));

            if (strcmp(type, "ds18b20_bus") == 0) {
                ds18b20_bus_count++;
                if (ds18b20_bus_count > 1) {
                    set_error("Only one ds18b20_bus sensor entry is allowed");
                    return normalize_cleanup_and_fail(root, ctx);
                }
                int gpio = jint(item, "gpio", -1);
                char owner[40] = {0};
                snprintf(owner, sizeof(owner), "sensor:%s", id);
                if (!reserve_gpio(ctx, gpio, owner, "")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }
                if (ctx->onewire_seen && ctx->onewire_gpio != gpio) {
                    set_error("DS18B20 sensors must share one OneWire bus");
                    return normalize_cleanup_and_fail(root, ctx);
                }
                ctx->onewire_seen = true;
                ctx->onewire_gpio = gpio;
                if (jbool(item, "enabled", true)) {
                    char rmt_owner[40] = {0};
                    snprintf(rmt_owner, sizeof(rmt_owner), "ds18b20:%s", id);
                    if (!reserve_rmt_blocks(ctx, rmt_owner, 1, rmt_blocks_for_symbols(10 * 8))) {
                        return normalize_cleanup_and_fail(root, ctx);
                    }
                }

                cJSON_AddNumberToObject(dst, "gpio", gpio);
                cJSON_AddNumberToObject(dst, "poll_interval_sec", jint(item, "poll_interval_sec", 30));
            } else {
                int sda = jint(item, "sda_gpio", -1);
                int scl = jint(item, "scl_gpio", -1);
                int address = jint(item, "address", strcmp(type, "aht20") == 0 ? 0x38 :
                                                 strcmp(type, "sht3x") == 0 ? 0x44 : 0x76);
                int freq = jint(item, "freq_hz", 100000);

                if (!reserve_gpio(ctx, sda, "i2c_sda", "i2c_sda") ||
                    !reserve_gpio(ctx, scl, "i2c_scl", "i2c_scl")) {
                    return normalize_cleanup_and_fail(root, ctx);
                }

                if (!ctx->i2c_bus_seen) {
                    ctx->i2c_bus_seen = true;
                    ctx->i2c_sda = sda;
                    ctx->i2c_scl = scl;
                    ctx->i2c_freq = freq;
                } else if (ctx->i2c_sda != sda || ctx->i2c_scl != scl || ctx->i2c_freq != freq) {
                    set_error("All I2C sensors must share the same SDA/SCL/freq bus settings");
                    return normalize_cleanup_and_fail(root, ctx);
                }

                cJSON_AddNumberToObject(dst, "sda_gpio", sda);
                cJSON_AddNumberToObject(dst, "scl_gpio", scl);
                cJSON_AddNumberToObject(dst, "address", address);
                cJSON_AddNumberToObject(dst, "freq_hz", freq);
                cJSON_AddNumberToObject(dst, "poll_interval_sec", jint(item, "poll_interval_sec", 30));
            }

            cJSON_AddItemToArray(sensors, dst);
        }
    }

    return normalize_cleanup_success(root, ctx);
}

static esp_err_t nvs_write_string(const char *s)
{
    nvs_handle_t h = 0;
    esp_err_t err = nvs_open(NVS_NS, NVS_READWRITE, &h);
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_set_str(h, NVS_KEY, s);
    if (err == ESP_OK) {
        err = nvs_commit(h);
    }
    nvs_close(h);
    return err;
}

static esp_err_t nvs_read_string(char **out)
{
    *out = NULL;

    nvs_handle_t h = 0;
    esp_err_t err = nvs_open(NVS_NS, NVS_READONLY, &h);
    if (err != ESP_OK) {
        return err;
    }

    size_t len = 0;
    err = nvs_get_str(h, NVS_KEY, NULL, &len);
    if (err != ESP_OK) {
        nvs_close(h);
        return err;
    }

    char *buf = calloc(1, len);
    if (!buf) {
        nvs_close(h);
        return ESP_ERR_NO_MEM;
    }

    err = nvs_get_str(h, NVS_KEY, buf, &len);
    nvs_close(h);
    if (err != ESP_OK) {
        free(buf);
        return err;
    }

    *out = buf;
    return ESP_OK;
}

static esp_err_t save_cfg_object(cJSON *cfg)
{
    char *out = cJSON_PrintUnformatted(cfg);
    if (!out) {
        set_error("Out of memory while serializing config");
        return ESP_ERR_NO_MEM;
    }

    esp_err_t err = nvs_write_string(out);
    free(out);
    if (err != ESP_OK) {
        set_error("NVS write failed: %s", esp_err_to_name(err));
        return err;
    }

    if (s_cfg) {
        cJSON_Delete(s_cfg);
    }
    s_cfg = cfg;
    clear_error();
    return ESP_OK;
}

const cJSON *cfg_json_get(void)
{
    return s_cfg;
}

esp_err_t cfg_json_load_or_default(void)
{
    clear_error();

    char *json = NULL;
    esp_err_t err = nvs_read_string(&json);
    if (err == ESP_OK && json) {
        cJSON *parsed = cJSON_Parse(json);
        free(json);

        if (parsed) {
            cJSON *normalized = normalize_config(parsed);
            cJSON_Delete(parsed);
            if (normalized) {
                ESP_LOGI(TAG, "Loaded config from NVS");
                return save_cfg_object(normalized);
            }
            ESP_LOGW(TAG, "Stored config invalid, using default: %s", cfg_json_last_error());
        } else {
            ESP_LOGW(TAG, "Stored config is invalid JSON, using default");
        }
    } else {
        ESP_LOGW(TAG, "No config in NVS, using default");
    }

    cJSON *def = create_empty_schema();
    if (!def) {
        set_error("Out of memory while creating default config");
        return ESP_ERR_NO_MEM;
    }
    return save_cfg_object(def);
}

esp_err_t cfg_json_set_and_save(const cJSON *new_cfg)
{
    if (!new_cfg) {
        set_error("Config payload is empty");
        return ESP_ERR_INVALID_ARG;
    }

    clear_error();
    cJSON *normalized = normalize_config(new_cfg);
    if (!normalized) {
        return ESP_ERR_INVALID_ARG;
    }

