klactrafob/esp32-c3_matter/src/core/cfg_json.c
    ESP_LOGI(TAG, "Saving normalized schema v%d config", CFG_SCHEMA_VERSION);
    return save_cfg_object(normalized);
}

esp_err_t cfg_json_reset_to_default(void)
{
    cJSON *def = create_empty_schema();
    if (!def) {
        set_error("Out of memory while creating default config");
        return ESP_ERR_NO_MEM;
    }
    return save_cfg_object(def);
}

esp_err_t cfg_json_force_relay_gpio12_profile(void)
{
    return ESP_OK;
}

static bool replace_string(cJSON *obj, const char *key, const char *value)
{
    return cJSON_ReplaceItemInObject(obj, key, cJSON_CreateString(value ? value : "")) != 0;
}

static bool replace_bool(cJSON *obj, const char *key, bool value)
{
    return cJSON_ReplaceItemInObject(obj, key, cJSON_CreateBool(value)) != 0;
}

static bool replace_number(cJSON *obj, const char *key, int value)
{
    return cJSON_ReplaceItemInObject(obj, key, cJSON_CreateNumber(value)) != 0;
}

esp_err_t cfg_json_clear_connectivity(void)
{
    if (!cJSON_IsObject(s_cfg)) {
        set_error("Config is not loaded");
        return ESP_ERR_INVALID_STATE;
    }

    cJSON *connectivity = cJSON_GetObjectItemCaseSensitive(s_cfg, "connectivity");
    cJSON *sta = cJSON_GetObjectItemCaseSensitive(connectivity, "sta");
    cJSON *mqtt = cJSON_GetObjectItemCaseSensitive(connectivity, "mqtt");
    if (!cJSON_IsObject(connectivity) || !cJSON_IsObject(sta) || !cJSON_IsObject(mqtt)) {
        set_error("Connectivity section is missing");
        return ESP_ERR_INVALID_STATE;
    }

    if (!replace_string(sta, "ssid", "") ||
        !replace_string(sta, "pass", "") ||
        !replace_bool(mqtt, "enable", false) ||
        !replace_string(mqtt, "host", "") ||
        !replace_number(mqtt, "port", 1883) ||
        !replace_string(mqtt, "user", "") ||
        !replace_string(mqtt, "pass", "")) {
        set_error("Out of memory while clearing connectivity");
        return ESP_ERR_NO_MEM;
    }

    return cfg_json_set_and_save(s_cfg);
}

esp_err_t cfg_json_factory_reset(void)
{
    nvs_handle_t h = 0;
    esp_err_t err = nvs_open(NVS_NS, NVS_READWRITE, &h);
    if (err != ESP_OK) {
        set_error("NVS open failed: %s", esp_err_to_name(err));
        return err;
    }

    err = nvs_erase_all(h);
    if (err == ESP_OK) {
        err = nvs_commit(h);
    }
    nvs_close(h);
    if (err != ESP_OK) {
        set_error("Factory reset failed: %s", esp_err_to_name(err));
        return err;
    }

    clear_error();
    return ESP_OK;
}
